<h2>Задание 1</h2>
<?php 
// Внешний цикл: первый множитель от 1 до 9
for($i = 1; $i <= 9; $i++){
    //Внутренний цикл: второй множитель от 1 до 9
    for($j = 1; $j <= 9; $j++){
        //Выводим пример и результат
        echo "$i * $j = " . ($i * $j) . "|";    
    }
    //После завершения внутреннего цикла переходим на новую строку
    echo '<br>';
}
?>
<h2>Задание 2</h2>
<?php 
$a = 4; 
$b = 3; 
//Внешний цикл: отвечает на строки (высоту)
for($i = 1; $i <= $b; $i++){
    //Внутренний цикл: отвечает за символы в одной строке (ширину)
    for($j = 1; $j <= $a; $j++){
        echo "x";
    }
    echo '<br>';
}
?>
<h2> Задание 3</h2>
for  ($row = 1; $row <= $size; $row++){
<tr>
    
}
<?php 